/*
#school - ТУЕС
#class - 11Б
#num - 20
#name - Красимир Светославов Стойков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<math.h>


int main()
{
	int x;
		
		do
		{
			printf("Vuvedete x, popadasht v intervala (0,10)\n");
			scanf("%d", &x);
		}
		while (x<=0 || x>=10);

	float mas[10];
	int N;
	float z;
	float sum = 0.00f;
	
		for (N = 0; N < 10; N++)
		{
			for (z = N*x; z < (N+1)*x; z++)
			{
				sum+= cos(z);
			}
			mas[N] = sum;
			sum = 0.00f;
		}
		int i;
		printf("Elementite na masiva: \n");
		for (i = 0; i < 10; i++)
		{
			printf("%f\n", mas[i]);
		}
	
return 0;
}

