/*
#school - ТУЕС
#class - 11Б
#num - 20
#name - Красимир Светославов Стойков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
	int x;
		
		do
		{
			printf("Vuvedete x, popadasht v intervala (0,10)\n");
			scanf("%d", &x);
		}
		while (x<=0 || x>=10);

	int mas[10];
	int sum = 0;
	int count = 0;
	int number; //chisloto N
	
		for (number = 0; count < 10; number++)
		{
			if (number%x == 0)
			{
				int z;
				for (z = 0; z <= number; z++)
				{
					sum+=z;
				}
				mas[count] = sum;
				count++;
				sum = 0;
			}
		}
		
	int i;
	
		printf("Elementite na masiva: \n");
		for (i = 0; i < 10; i++)
		{
			printf("%d\n", mas[i]);
		}
	
return 0;
}

